app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function login()
    {
        // If already logged in, go to dashboard
        if (session()->get('logged_in')) {
            return redirect()->to('/dashboard');
        }

        // If GET request — just show login form
        if ($this->request->getMethod() === 'GET') {
            return view('auth/login');
        }

        // If POST request — process login
        if ($this->request->getMethod() === 'POST') {
            // Validation rules
            if (!$this->validate([
                'email'    => 'required|valid_email',
                'password' => 'required|min_length[6]',
            ])) {
                return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
            }

            $userModel = new UserModel();
            $email     = $this->request->getPost('email');
            $password  = $this->request->getPost('password');

            $user = $userModel->where('email', $email)->first();

INSERT INTO `users` (`username`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('sample789', 'sample789@gmail.com', '$2y$10$/b80PPIuEsXDESmDoQA.ZewKG91AUD4fx6En0SVvYjkyqXDyi0NS6', 'student', '2025-10-09 13:53:35', '2025-10-09 13:53:35')
---
            ];

            // Save user
            if ($userModel->save($data)) {