app/Controllers/Auth.php

    public function login()
    {
        if (session()->get('logged_in')) {
            return redirect()->to('/dashboard');
        }

        if ($this->request->getMethod() === 'POST') {
            $userModel = new UserModel();
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'
 LIMIT 1

    public function dashboard()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Please login first.');
        }

        $role = session()->get('role');
        $name = session()->get('username');

        $data = [
            'role' => $role,
            'name' => $name,
        ];

        // ✅ Only load student-specific data
        if ($role === 'student') {
            $enrollmentModel = new \App\Models\EnrollmentModel();
            $courseModel     = new \App\Models\CourseModel();

            $data['enrollments'] = $enrollmentModel->getUserEnrollments(session()->get('user_id'));
            $data['courses']     = $courseModel->findAll();
---
SELECT *
FROM `courses`