app/Models/EnrollmentModel.php

    public function enrollUser($data)
    {
        return $this->insert($data);
---
INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`) VALUES ('4', '1', '2025-10-13 09:33:12')

 public function getUserEnrollments($user_id)
{
     return $this->select('enrollments.*, courses.id as course_id, courses.course_code, courses.course_name')
                ->join('courses', 'courses.id = enrollments.course_id')
                ->where('enrollments.user_id', $user_id)
                ->orderBy('enrollments.enrollment_date', 'DESC')
                ->findAll();
---
SELECT `enrollments`.*, `courses`.`id` as `course_id`, `courses`.`course_code`, `courses`.`course_name`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '4'
ORDER BY `enrollments`.`enrollment_date` DESC

    public function isAlreadyEnrolled($user_id, $course_id)
    {
        return $this->where('user_id', $user_id)
                    ->where('course_id', $course_id)
                    ->first() !== null;
---
SELECT *
FROM `enrollments`
WHERE `user_id` = '4'
AND `course_id` = '1'
 LIMIT 1